#+title: Stacks and Queues
#+subtitle: Introduction to Abstract Data Types
#+author: Franck Chauvel
#+language: en

#+SETUPFILE: ../templates/style.org

*** Push

    #+name: code:push
    #+begin_src ruby -n -r
      def push(stack, item)
        stack.append(item)
      end
    #+end_src

    #+name: code:push-tests
    #+headers: :exports results
    #+headers: :results output
    #+headers: :noweb strip-export
    #+begin_src ruby -n -r
      <<code:push>>
      stack = []
      push(stack, 2)
      push(stack, 3)

      puts "Stack: #{stack}"
    #+end_src

    #+RESULTS:
    : Stack: [2, 3]




*** Pop

    #+name: code:pop
    #+begin_src ruby -n -r
      def pop(stack)
        return stack.pop()
      end
    #+end_src

    #+name: code:pop-tests
    #+headers: :exports both
    #+headers: :results output
    #+headers: :noweb strip-export
    #+begin_src ruby -n -r
      <<code:push>>
      <<code:pop>>
      stack = []
      push(stack, 2)
      push(stack, 3)
      puts "Stack: #{stack}"
      pop(stack)
      puts "Stack: #{stack}" 
    #+end_src

    #+RESULTS: code:pop-tests
    : Stack: [2, 3]
    : Stack: [2]


** Pre and Post conditions


   #+headers: :classname Stack
   #+headers: :exports code
   #+headers: :results output
   #+begin_src java -n -r
      public class Stack<Item> {

          private final int capacity;
          private final Object[] items;
          private int length;

          public Stack(int capacity) {
              this.capacity = capacity;
              this.items = new Object[capacity];
              this.length = 0;
          }

          public void push(Item item) {
              this.length += 1;
              this.items[length-1] = item;
          }

          public Item top() {
            return (Item) this.items[this.length-1];
          }

          public boolean isEmpty() {
             return this.size() == 0;
          }

          public Item pop() throws IllegalStateException {
              final int previousLength = this.length;
              if (this.isEmpty())
                 throw new IllegalStateException("Cannot 'pop' the empty stack!"); 

             Item top = this.top();
             this.items[this.length-1] = null;
             this.length -= 1;

             if (this.length != previousLength-1)
                throw new RuntimeException("Invalid pop behaviour")

             return top;
          }

          public int size() {
             return this.length;
          }

          public static void main(String[] args) {
              Stack<Integer> stack= new Stack<Integer>(100);
              stack.push(20);
              stack.push(22);
              System.out.println("Size: " + stack.size());
          }

     }
   #+end_src

   #+RESULTS:
   : Size: 2

